<?php   
echo "-----------------------------------------------------------------------------------------------------------------------<br>"
,"<br>","Exer.3▼","<br>";  

    $province = array ("สุราษฎร์","กระบี่","ชุมพร","นครศรีธรรมราช");
    for($loop = count ($province)-1; $loop >= 0; $loop--){
        printf("%s <br>",$province[$loop]);
    }

echo    "<br>","<br>";
//จบExer.
echo "-----------------------------------------------------------------------------------------------------------------------<br>"
,"<br>","Exer.4▼","<br>";

    $array = array("number"=>"1","text"=>"text","1",2,3);
    printf("%d<br>",sizeof($array));

echo    "<br>","<br>";
//จบExer.
echo "-----------------------------------------------------------------------------------------------------------------------<br>"
,"<br>","Exer.5▼","<br>";

    $array = array (1, "hello",1,"world","hello","number"=>1,"text"=>"hello");
    print_r(array_count_values ($array));
    
echo    "<br>","<br>";
//จบExer.
?>
